In [ ]:
#In this file we are going to analyze the houses dataset using SQL . The reason I am doing it through the notebook is 
# that it stores the queries as well as the result which is not available in any of the SQL applications

# Necessary procedures to load SQL file

In [1]:
%load_ext sql

In [2]:
%sql sqlite:///House.sqlite3

# Viewing dataset

In [3]:
%sql select * from houses limit 10

 * sqlite:///House.sqlite3
Done.

[(313000, 3, 1.5, 1340, 7912, 1.5, 0, 0, 3, 1340, 0, 1955, 2005, '18810 Densmore Ave N', 'Shoreline', 'WA 98133', 'USA'),
 (2384000, 5, 2.5, 3650, 9050, 2, 0, 4, 5, 3370, 280, 1921, 0, '709 W Blaine St', 'Seattle', 'WA 98119', 'USA'),
 (342000, 3, 2.0, 1930, 11947, 1, 0, 0, 4, 1930, 0, 1966, 0, '26206-26214 143rd Ave SE', 'Kent', 'WA 98042', 'USA'),
 (420000, 3, 2.25, 2000, 8030, 1, 0, 0, 4, 1000, 1000, 1963, 0, '857 170th Pl NE', 'Bellevue', 'WA 98008', 'USA'),
 (550000, 4, 2.5, 1940, 10500, 1, 0, 0, 4, 1140, 800, 1976, 1992, '9105 170th Ave NE', 'Redmond', 'WA 98052', 'USA'),
 (490000, 2, 1.0, 880, 6380, 1, 0, 0, 3, 880, 0, 1938, 1994, '522 NE 88th St', 'Seattle', 'WA 98115', 'USA'),
 (335000, 2, 2.0, 1350, 2560, 1, 0, 0, 3, 1350, 0, 1976, 0, '2616 174th Ave NE', 'Redmond', 'WA 98052', 'USA'),
 (482000, 4, 2.5, 2710, 35868, 2, 0, 0, 3, 2710, 0, 1989, 0, '23762 SE 253rd Pl', 'Maple Valley', 'WA 98038', 'USA'),
 (452500, 3, 2.5, 2430, 88426, 1, 0, 0, 4, 1570, 860, 1985, 0, '46611-46625 SE 129th St', 'North Bend', 'WA 98045', 'USA'),
 (640000, 4, 2.0, 1520, 6200, 1.5, 0, 0, 3, 1520, 0, 1945, 2010, '6811 55th Ave NE', 'Seattle', 'WA 98115', 'USA')]

# Analysing dataset

In [30]:
# To find the information about the house having highest price

In [7]:
%sql select * from houses where price in(select max(price) from houses)

 * sqlite:///House.sqlite3
Done.

[(26590000, 3, 2.0, 1180, 7793, 1, 0, 0, 4, 1180, 0, 1992, 0, '12005 SE 219th Ct', 'Kent', 'WA 98031', 'USA')]

In [31]:
#To find the average price per city

In [4]:
%sql select city,round(avg(price),0) as average_price from houses group by city limit 10

 * sqlite:///House.sqlite3
Done.

[('Algona', 207288.0),
 ('Auburn', 299340.0),
 ('Beaux Arts Village', 745000.0),
 ('Bellevue', 847181.0),
 ('Black Diamond', 339606.0),
 ('Bothell', 481442.0),
 ('Burien', 348947.0),
 ('Carnation', 508752.0),
 ('Clyde Hill', 1321945.0),
 ('Covington', 296230.0)]

In [ ]:
#To find the average price per year

In [5]:
%sql select yr_built as Built_in_year,round(avg(price),0) as average_price from houses group by yr_built limit 10

 * sqlite:///House.sqlite3
Done.

[(1900, 701045.0),
 (1901, 506127.0),
 (1902, 854725.0),
 (1903, 513010.0),
 (1904, 501933.0),
 (1905, 782053.0),
 (1906, 596786.0),
 (1907, 583383.0),
 (1908, 516868.0),
 (1909, 821755.0)]

In [29]:
# To find the number of houses having waterfronts

In [32]:
%sql select count(waterfront) as Having_watefronts from houses where waterfront=1

 * sqlite:///House.sqlite3
Done.

[(33,)]

In [ ]:
#To find the maximum number of bedrooms

In [33]:
%sql select max(bedrooms) from houses

 * sqlite:///House.sqlite3
Done.

[(9,)]

In [ ]:
#To find the address of the most expensive house

In [37]:
%sql select street,city,statezip,price from houses where price in(select max(price) from houses)

 * sqlite:///House.sqlite3
Done.

[('12005 SE 219th Ct', 'Kent', 'WA 98031', 26590000)]

In [ ]:
#To find the information about the houses in good condition

In [6]:
%sql select condition,* from houses where condition in(4,5) limit 10

 * sqlite:///House.sqlite3
Done.

[(5, 2384000, 5, 2.5, 3650, 9050, 2, 0, 4, 5, 3370, 280, 1921, 0, '709 W Blaine St', 'Seattle', 'WA 98119', 'USA'),
 (4, 342000, 3, 2.0, 1930, 11947, 1, 0, 0, 4, 1930, 0, 1966, 0, '26206-26214 143rd Ave SE', 'Kent', 'WA 98042', 'USA'),
 (4, 420000, 3, 2.25, 2000, 8030, 1, 0, 0, 4, 1000, 1000, 1963, 0, '857 170th Pl NE', 'Bellevue', 'WA 98008', 'USA'),
 (4, 550000, 4, 2.5, 1940, 10500, 1, 0, 0, 4, 1140, 800, 1976, 1992, '9105 170th Ave NE', 'Redmond', 'WA 98052', 'USA'),
 (4, 452500, 3, 2.5, 2430, 88426, 1, 0, 0, 4, 1570, 860, 1985, 0, '46611-46625 SE 129th St', 'North Bend', 'WA 98045', 'USA'),
 (5, 1400000, 4, 2.5, 2920, 4000, 1.5, 0, 0, 5, 1910, 1010, 1909, 1988, '3838-4098 44th Ave NE', 'Seattle', 'WA 98105', 'USA'),
 (4, 365000, 3, 1.0, 1090, 6435, 1, 0, 0, 4, 1090, 0, 1955, 2009, '2504 SW Portland Ct', 'Seattle', 'WA 98106', 'USA'),
 (4, 242500, 3, 1.5, 1200, 9720, 1, 0, 0, 4, 1200, 0, 1965, 0, '14034 SE 201st St', 'Kent', 'WA 98042', 'USA'),
 (4, 419000, 3, 1.5, 1570, 6700, 1, 0, 0, 4, 1570, 0, 1956, 0, '15424 SE 9th St', 'Bellevue', 'WA 98007', 'USA'),
 (5, 750000, 3, 1.75, 2240, 10578, 2, 0, 0, 5, 1550, 690, 1923, 0, '3225 NE 92nd St', 'Seattle', 'WA 98115', 'USA')]

In [ ]:
#To find the number of houses not having a basement

In [41]:
%sql SELECT count(sqft_basement) as Not_having_basement  from houses where sqft_basement=0

 * sqlite:///House.sqlite3
Done.

[(2745,)]

In [ ]:
#To find the maximum and minimum number of floors

In [44]:
%sql select max(floors) as maximum_floors ,min(floors) as minimum_floors from houses

 * sqlite:///House.sqlite3
Done.

[(3.5, 1)]

In [ ]:
# To find the number of houses in each city

In [7]:
%sql select city,count(city) as number_of_houses  from houses group by city limit 10

 * sqlite:///House.sqlite3
Done.

[('Algona', 5),
 ('Auburn', 176),
 ('Beaux Arts Village', 1),
 ('Bellevue', 286),
 ('Black Diamond', 9),
 ('Bothell', 33),
 ('Burien', 74),
 ('Carnation', 22),
 ('Clyde Hill', 11),
 ('Covington', 43)]

In [ ]:
# To find the information about the renovated houses

In [8]:
%sql select street,yr_renovated from houses where yr_renovated is not 0 limit 10

 * sqlite:///House.sqlite3
Done.

[('18810 Densmore Ave N', 2005),
 ('9105 170th Ave NE', 1992),
 ('522 NE 88th St', 1994),
 ('6811 55th Ave NE', 2010),
 ('Burke-Gilman Trail', 1994),
 ('3838-4098 44th Ave NE', 1988),
 ('2504 SW Portland Ct', 2009),
 ('3534 46th Ave NE', 1969),
 ('1605 S 245th Pl', 2000),
 ('12425 415th Ave SE', 2009)]

In [ ]:
#To find the citites ending with 'e'

In [60]:
%sql select distinct city from houses where city like('%e')

 * sqlite:///House.sqlite3
Done.

[('Shoreline',),
 ('Seattle',),
 ('Bellevue',),
 ('Woodinville',),
 ('Snoqualmie',),
 ('Kenmore',),
 ('Newcastle',),
 ('Ravensdale',),
 ('Beaux Arts Village',)]